package MokRanSplitProgram;

public class Structure {
	
	//*별 표시 Pocket에 주머니 만들기 
	
	// 몇명이 방문 예정 입니까?  >> Scanner. 배열에 입력 
	// *이름을 입력해주세요. >> Pocket 에 빈표 생성 (생성자)  
	// 식사 or 코스 를 선택해주세요  >> if 문 1.식사/2.코스 
		// *식사 메뉴 선택해 주세요  
			// 식사 메뉴판     >> Data에 따로 데이터 저장 Poket 에서 사용 가능한가? 확인필요
			// 각 인원별 선택   >> 이름이 나오게 메뉴판은 한번만 나와도 될듯.
		//*코스 선택해주세요      
			//코스 메뉴판      >>
			//한개 선택 (각인원 배분) >> 선택한 코스 각 이름 배열 뒤에 넣기 
	// *요리를 선택해주세요 
		//요리 메뉴판
	// 총액 계산    >>여기서 부터 데이터 꺼내오기 + 더하기  Calculate에 필요 함수 저장 
		// 식사 선택
		//Roxie- 짜장면 : 10000원
		//Bella- 짬뽕 : 15000원
		//Olive- 긴스면 : 15000원
		//요리선택
		//동파육 : 30000원
		//멘보샤 : 30000원
		//*1인당 요리 더치페이금액 : 20000원
		//=========================
		// 개별 지불 예상액 
		// Roxie : 30000원
		// Bella : 35000원
		// Olive : 35000원
	
	
	
}
